.doom.d/config.org
*** Shell
**** Eshell git prompt
#+begin_src emacs-lisp :tangle "packages.el" :comments no
(package! eshell-git-prompt)
#+end_src

#+begin_src emacs-lisp
(after! eshell
          (eshell-git-prompt-use-theme 'powerline)
)
#+end_src
*** Fun
**** Spotify
#+begin_src emacs-lisp :tangle "packages.el" :comments no
(package! smudge)
#+end_src
#+begin_src emacs-lisp
(use-package! smudge
  :config
  (setq smudge-oauth2-client-id "48e1012bfd264c129bf0c89966817aca"
    smudge-oauth2-client-secret "e6c298a6bf1343f1a3b05253c252af16")
)
#+end_src
**** Academic Phrases
#+begin_src emacs-lisp :tangle "packages.el" :comments no
(package! academic-phrases)
#+end_src
*** UI
**** Treemacs
#+begin_src emacs-lisp
(add-hook! treemacs-mode
  (treemacs-load-theme "doom-colors")
  )
#+end_src
**** Command Log
#+begin_src emacs-lisp :tangle "packages.el" :comments no
(package! command-log-mode)
#+end_src
#+begin_src emacs-lisp
(use-package! command-log-mode)
#+end_src

*** Window Management
**** EXWM
***** Core
#+begin_src emacs-lisp :tangle "packages.el" :comments no
;; (package! exwm)
#+end_src
#+begin_src emacs-lisp
;; (defun a3madkour/run-in-background (command)
;;   (let ((command-parts (split-string command "[ ]+")))
;;     (apply #'call-process `(,(car command-parts) nil 0 nil ,@(cdr command-parts)))))

;; ;; (defun a3madkour/set-wallpaper ()
;; ;;   (interactive)
;; ;;   ;; NOTE: You will need to update this to a valid background path!
;; ;;   (start-process-shell-command
;; ;;    "feh" nil  "feh --bg-scale /usr/share/backgrounds/matt-mcnulty-nyc-2nd-ave.jpg"))

;; (defun a3madkour/exwm-init-hook ()
;;   ;; Make workspace 1 be the one where we land at startup
;;   (exwm-workspace-switch-create 0)

;;   ;; Open eshell by default
;;   ;;(eshell)

;;   ;; Show battery status in the mode line
;;   (display-battery-mode 1)

;;   ;; Show the time and date in modeline
;;   ;; (setq display-time-day-and-date t)
;;   ;; (display-time-mode 1)
;;   ;; Also take a look at display-time-format and format-time-string

;;   (a3madkour/start-panel)
;;   ;; Launch apps that will run in the background
;;   (a3madkour/run-in-background "dunst")
;;   (a3madkour/run-in-background "nm-applet")
;;   (a3madkour/run-in-background "pasystray")
;;   (a3madkour/run-in-background "blueman-applet"))

;; (defun a3madkour/exwm-update-class ()
;;   (exwm-workspace-rename-buffer exwm-class-name))

;; (defun a3madkour/exwm-update-title ()
;;   (pcase exwm-class-name
;;     ("Brave-browser" (exwm-workspace-rename-buffer (format "Brave-browser: %s" exwm-title)))))

;; ;; This function should be used only after configuring autorandr!
;; (defun a3madkour/update-displays ()
;;   (a3madkour/run-in-background "autorandr --change --force")
;;   (message "Display config: %s"
;;            (string-trim (shell-command-to-string "autorandr --current"))))

;; (use-package! exwm
;;   :config
;;   ;; Set the default number of workspace
;;   (setq exwm-workspace-number 5)

;;   ;; When window "class" updates, use it to set the buffer name
;;   (add-hook! 'exwm-update-class-hook #'a3madkour/exwm-update-class)

  ;; When window title updates, use it to set the buffer name
  ;; (add-hook! 'exwm-update-title-hook #'a3madkour/exwm-update-title)

  ;; When EXWM starts up, do some extra configuration
  ;; (add-hook! 'exwm-init-hook #'a3madkour/exwm-init-hook )

  ;; (start-process-shell-command "xmodmap" nil "xmodmap ~/.emacs.d/exwm/Xmodmap")

  ;; (require 'exwm-randr)
  ;; (exwm-randr-enable)

  ;; (setq exwm-randr-workspace-monitor-plist
  ;;       (pcase (system-name)
  ;;         ("labmachine" '(2 "HDMI-1" 3 "HDMI-1"))
  ;;         ("linuxmachine" '(2 "DP-1-2" 3 "DP-1-2"))))

  ;; ;; React to display connectivity changes, do initial display update
  ;; (add-hook 'exwm-randr-screen-change-hook #'a3madkour/update-displays)
  ;; (a3madkour/update-displays)

  ;; (require 'exwm-systemtray)
  ;; (exwm-systemtray-enable)

  ;; Automatically send the mouse cursor to the selected workspace's display
  ;; (setq exwm-workspace-warp-cursor t)

  ;; Window focus should follow the mouse pointer
  ;; (setq mouse-autoselect-window t
  ;;       focus-follows-mouse t)

  ;; (setq exwm-input-prefix-keys
  ;;       '(?\C-x
  ;;         ?\C-u
  ;;         ?\C-h
  ;;         ?\M-x
  ;;         ?\M-`
  ;;         ?\M-&
  ;;         ?\M-:
  ;;         ?\C-\M-j
  ;;         ?\C-\ ))

  ;; (define-key exwm-mode-map [?\C-q]   'exwm-input-send-next-key)


  ;; (setq exwm-input-global-keys
  ;;       `(
          ;; Reset to line-mode (C-c C-k switches to char-mode via exwm-input-release-keyboard)
  ;;         ([?\s-r] . exwm-reset)

  ;;         ;; Move between windows
  ;;         ([?\s-h] . windmove-left)
  ;;         ([?\s-l] . windmove-right)
  ;;         ([?\s-k] . windmove-up)
  ;;         ([?\s-j] . windmove-down)

  ;;         ;; Launch applications via shell command
  ;;         ([?\s-&] . (lambda (command)
  ;;                      (interactive (list (read-shell-command "$ ")))
  ;;                      (start-process-shell-command command nil command)))

  ;;         ;; Switch workspace
  ;;         ([?\s-w] . exwm-workspace-switch)
  ;;         ([?\s-`] . (lambda () (interactive) (exwm-workspace-switch-create 0)))

  ;;         ;; 's-N': Switch to certain workspace with Super (Win) plus a number key (0 - 9)
  ;;         ,@(mapcar (lambda (i)
  ;;                     `(,(kbd (format "s-%d" i)) .
  ;;                       (lambda ()
  ;;                         (interactive)
  ;;                         (exwm-workspace-switch-create ,i))))
  ;;                   (number-sequence 0 9))))

  ;; (exwm-input-set-key (kbd "s-SPC") 'counsel-linux-app)

  ;; (exwm-enable)
  ;; )
#+end_src

**** Desktop Environment
#+begin_src emacs-lisp :tangle "packages.el" :comments no
;; (package! desktop-environment)
#+end_src
#+begin_src emacs-lisp
;; (use-package! desktop-environment
;;   :after exwm
;;   :config (desktop-environment-mode)
;;   :custom
;;   (desktop-environment-brightness-small-increment "2%+")
;;   (desktop-environment-brightness-small-decrement "2%-")
;;   (desktop-environment-brightness-normal-increment "5%+")
;;   (desktop-environment-brightness-normal-decrement "5%-"))
#+end_src
**** Polybar
#+begin_src emacs-lisp
;; Make sure the server is started (better to do this in your main Emacs config!)
;; (server-start)

;; (defvar a3madkour/polybar-process nil
;;   "Holds the process of the running Polybar instance, if any")

;; (defun a3madkour/kill-panel ()
;;   (interactive)
;;   (when a3madkour/polybar-process
;;     (ignore-errors
;;       (kill-process a3madkour/polybar-process)))
;;   (setq a3madkour/polybar-process nil))

;; (defun a3madkour/start-panel ()
;;   (interactive)
;;   (a3madkour/kill-panel)
;;   (setq a3madkour/polybar-process (start-process-shell-command "polybar" nil "polybar panel")))

;; (defun a3madkour/send-polybar-hook (module-name hook-index)
;;   (start-process-shell-command "polybar-msg" nil (format "polybar-msg hook %s %s" module-name hook-index)))

;; (defun a3madkour/send-polybar-exwm-workspace ()
;;   (a3madkour/send-polybar-hook "exwm-workspace" 1))

;; ;; Update panel indicator when workspace changes
;; (add-hook 'exwm-workspace-switch-hook #'a3madkour/send-polybar-exwm-workspace)
#+end_src
**** Dunst
#+begin_src emacs-lisp
;; (defun a3madkour/disable-desktop-notifications ()
;;   (interactive)
;;   (start-process-shell-command "notify-send" nil "notify-send \"DUNST_COMMAND_PAUSE\""))

;; (defun a3madkour/enable-desktop-notifications ()
;;   (interactive)
;;   (start-process-shell-command "notify-send" nil "notify-send \"DUNST_COMMAND_RESUME\""))

;; (defun a3madkour/toggle-desktop-notifications ()
;;   (interactive)
;;   (start-process-shell-command "notify-send" nil "notify-send \"DUNST_COMMAND_TOGGLE\""))
#+end_src
*** Email
**** Mu4e
#+begin_src emacs-lisp
 (after! mu4e
   ;;   :config
   ;;   ;; This is set to 't' to avoid mail syncing issues when using mbsync
   (setq mu4e-change-filenames-when-moving t)

   ;;   ;; Refresh mail using isync every 10 minutes
   (setq mu4e-update-interval (* 10 60))
   (setq mu4e-get-mail-command "mbsync -a")
   (setq mu4e-root-maildir "~/Mail")


   (setq mu4e-contexts
         (list
          ;; Personal account
          (make-mu4e-context
           :name "Personal"
           :match-func
           (lambda (msg)
             (when msg
               (string-prefix-p "/Gmail" (mu4e-message-field msg :maildir))))
           :vars '((user-mail-address . "a3madkour@gmail.com")
                   (user-full-name    . "Abdelrahman Madkour Gmail")
                   (mu4e-drafts-folder  . "/Gmail/Drafts")
                   (mu4e-sent-folder  . "/Gmail/Sent Mail")
                   (mu4e-refile-folder  . "/Gmail/All Mail")
                   (mu4e-trash-folder  . "/Gmail/Trash")))

          ;; Maroon Loop account
          (make-mu4e-context
           :name "Maroon"
           :match-func
           (lambda (msg)
             (when msg
               (string-prefix-p "/MaroonLoop" (mu4e-message-field msg :maildir))))
           :vars '((user-mail-address . "loopmaroon@gmail.com")
                   (user-full-name    . "Maroon Loop Gmail")
                   (mu4e-drafts-folder  . "/MaroonLoop/Drafts")
                   (mu4e-sent-folder  . "/MaroonLoop/Sent Mail")
                   (mu4e-refile-folder  . "/MaroonLoop/All Mail")
                   (mu4e-trash-folder  . "/MaroonLoop/Trash")))))

   (setq mu4e-maildir-shortcuts
         '((:maildir "/Gmail/Inbox"    :key ?i)
           (:maildir "/Gmail/Sent Mail" :key ?s)
           (:maildir "/Gmail/Trash"     :key ?t)
           (:maildir "/Gmail/Drafts"    :key ?d)
           (:maildir "/Gmail/All Mail"  :key ?a)))
   (mu4e t)
   )
#+end_src
*** Screenwriting
**** Fountain
#+begin_src emacs-lisp :tangle "packages.el" :comments no
(package! fountain-mode)
#+end_src
*** Messaging
*** Cooking
**** Org-chef
#+begin_src emacs-lisp :tangle "packages.el" :comments no
(package! org-chef)
#+end_src
*** Time management
**** Org clock csv
#+begin_src emacs-lisp :tangle "packages.el" :comments no
(package! org-clock-csv)
#+end_src
*** Utils
**** Calendar
***** Org-gcal
#+begin_src emacs-lisp
(require 'org-gcal)
(setq org-gcal-client-id "497062789073-ebje9tkqvv79gnm1e0q5uvdgaaqp6mt0.apps.googleusercontent.com"
      org-gcal-client-secret "WPeCGrJjihtqRm_D3oz9PWmS"
      org-gcal-file-alist '(("a3madkour@gmail.com" .  "~/org/gcal.org")))

(add-hook! 'evil-org-agenda-mode-hook 'org-gcal-fetch)
(add-hook! 'cfw:calendar-mode-hook 'org-gcal-fetch)
#+end_src
**** Ripgrep
#+begin_src emacs-lisp :tangle "packages.el" :comments no
(package! rg)
#+end_src

** Language Packages
*** Python
**** Debugger
#+begin_src emacs-lisp
(add-hook 'python-mode-hook (lambda ()
                            (setq dap-python-debugger 'debugpy)))
#+end_src
**** Sphinx
#+begin_src emacs-lisp :tangle "packages.el" :comments no
(package! sphinx-doc)
#+end_src
#+begin_src emacs-lisp
(add-hook 'python-mode-hook (lambda ()
                            (require 'sphinx-doc)
                            (sphinx-doc-mode t)))
(map!
 :mode python-mode
 :localleader
       "d" #'sphinx-doc
 )
#+end_src
**** IPython Notebook
#+begin_src emacs-lisp :tangle "packages.el" :comments no
(package! ein)
#+end_src
*** GDScript
#+begin_src emacs-lisp :tangle "packages.el" :comments no
(package! gdscript-mode)
#+end_src
*** Org Mode
**** System Config
#+begin_src emacs-lisp
;; If you use `org' and don't want your org files in the default location below,
;; change `org-directory'. It must be set before org loads!
(setq org-directory "~/org/")
#+end_src
***** Loading Org
#+begin_src emacs-lisp
;; (defun a3madkour/org-mode-setup ()
;; (org-indent-mode)
;; (org-superstar-mode 1)
;; (variable-pitch-mode 1)
;; )
#+end_src

#+begin_src emacs-lisp
;; (use-package! org
;; :hook (org-mode . a3madkour/org-mode-setup))
#+end_src
***** Font Setup
#+begin_src emacs-lisp
(defun a3madkour/org-font-setup ()
  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  ;; Set faces for heading levels
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))
#+end_src

***** After Org is loaded
#+begin_src emacs-lisp
(after! org
#+end_src
****** Basic Setup
#+begin_src emacs-lisp
(defun cm/deft-parse-title (file contents)
    "Parse the given FILE and CONTENTS and determine the title.
  If `deft-use-filename-as-title' is nil, the title is taken to
  be the first non-empty line of the FILE.  Else the base name of the FILE is
  used as title."
      (let ((begin (string-match "^#\\+[tT][iI][tT][lL][eE]: .*$" contents)))
	(if begin
	    (string-trim (substring contents begin (match-end 0)) "#\\+[tT][iI][tT][lL][eE]: *" "[\n\t ]+")
	  (deft-base-filename file))))

(advice-add 'deft-parse-title :override #'cm/deft-parse-title)

(setq deft-strip-summary-regexp
(concat "\\("
    "[\n\t]" ;; blank
    "\\|^#\\+[[:alpha:]_]+:.*$" ;; org-mode metadata
    "\\|^:PROPERTIES:\n\\(.+\n\\)+:END:\n"
    "\\)"))

(setq
 org_notes "~/org/notes"
 zot_bib  "~/org/notes/library.bib"
 deft-directory org_notes
 ;; deft-strip-summary-regexp ":PROPERTIES:\n\\(.+\n\\)+:END:\n"
 org-cite-default-bibliography (list zot_bib)
 org-cite-global-bibliography (list zot_bib)
 ;; deft-use-filename-as-title 't
 ;; deft-recursive 't
 org-roam-directory org_notes
 )
#+end_src

****** Org Tempo
#+begin_src emacs-lisp
  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("sc" . "src scheme"))
  (add-to-list 'org-structure-template-alist '("ts" . "src typescript"))
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("yaml" . "src yaml"))
  (add-to-list 'org-structure-template-alist '("json" . "src json"))
#+end_src
