.doom.d/packages.el

(package! eshell-git-prompt)

(package! smudge)

(package! academic-phrases)

(package! command-log-mode)

;; (package! exwm)

;; (package! desktop-environment)

(package! fountain-mode)

(package! org-chef)

(package! org-clock-csv)

(package! sphinx-doc)

(package! ein)

(package! gdscript-mode)
