.doom.d/config.org
****** Org Capture
#+begin_src emacs-lisp
(defun org-get-habit-type ()
  (setq habit-type (read-string "Enter Habit Type: "))
  habit-type
)
  (setq org-capture-templates
        '(("t" "Todo" entry (file+datetree "~/org/tasks.org")
           "* TODO %?\n")
          ("u" "Unscheduled task" entry (file+headline "~/org/tasks.org" "Unscheduled tasks")
           "* TODO %?\n")
          ("c" "Cookbook" entry (file "~/org/cookbook.org")
           "%(org-chef-get-recipe-from-url)"
           :empty-lines 1)
          ("z" "Manual Cookbook" entry (file "~/org/cookbook.org")
           "* %^{Recipe title: }\n  :PROPERTIES:\n  :source-url:\n  :servings:\n  :prep-time:\n  :cook-time:\n  :ready-in:\n  :END:\n** Ingredients\n   %?\n** Directions\n\n")
          ("b" "Manual Book" entry (file "~/org/reading-list.org")
           "* %^{TITLE}\n:PROPERTIES:\n:ADDED: %<[%Y-%02m-%02d]>\n:END:%^{AUTHOR}p\n%?" :empty-lines 1)
          ("r" "Research Journal" entry (file+datetree "~/org/research-journal.org")
           "* %T \n %?")
          ("m" "Meeting" entry (file"~/org/meetings.org")
           "* %t \n %?")
          ("g" "Game idea" entry (file+headline "~/org/ideas.org" "Game")
           "* %?\n")
          ("p" "Paper idea" entry (file+headline "~/org/ideas.org" "Paper")
           "* %?\n")
          ("a" "App idea" entry (file+headline "~/org/ideas.org" "App")
           "* %?\n")
          ("v" "Video idea" entry (file+headline "~/org/ideas.org" "Video")
           "* %?\n")
          ("w" "Vague idea" entry (file+headline "~/org/ideas.org" "Vague af")
           "* %?\n")
          ("h" "Habit" entry (file+function "~/org/habits.org" org-get-habit-type)
           "* TODO %?\nSCHEDULED:%(org-insert-time-stamp (org-read-date nil t) nil nil nil nil \" .+1d\")\n:PROPERTIES:\n:STYLE:    habit\n:END:\n")
          ))
#+end_src
****** Ox-pandoc
#+begin_src emacs-lisp
;; default options for all output formats
(setq org-pandoc-options '((standalone . t)))
;; cancel above settings only for 'docx' format
(setq org-pandoc-options-for-docx '((standalone . nil)))
;; special settings for beamer-pdf and latex-pdf exporters
(setq org-pandoc-options-for-beamer-pdf '((pdf-engine . "xelatex")))
(setq org-pandoc-options-for-latex-pdf '((pdf-engine . "pdflatex")))
;; special extensions for markdown_github output
(setq org-pandoc-format-extensions '(markdown_github+pipe_tables+raw_html))
#+end_src
****** Org Agenda
#+begin_src emacs-lisp
  (setq org-agenda-files
    (quote
     ("~/org/gcal.org" "~/org/tasks.org" "~/org/habits.org")))
#+end_src

#+begin_src emacs-lisp
  (setq evil-org-key-theme '(textobjects navigation additional insert todo))
  (setq org-todo-keywords
        '((sequence "TODO(t!)" "NEXT(n!)" "DOINGNOW(d!)" "BLOCKED(b!)" "FOLLOWUP(f!)" "TICKLE(T!)" "|" "CANCELLED(c!)" "DONE(F!)")))
  (setq org-todo-keyword-faces
        '(("TODO" . org-warning)
          ("DOINGNOW" . "#E35DBF")
          ("CANCELED" . (:foreground "white" :background "#4d4d4d" :weight bold))
          ("NEXT" . "#008080")
        	("DONE" . "PaleGreen"))
        )
#+end_src

#+begin_src emacs-lisp
  (setq org-agenda-start-with-log-mode t)
  (setq org-log-done 'time)
  (setq org-log-into-drawer t)
#+end_src
******* Org-super-agenda
#+begin_src emacs-lisp :tangle "packages.el" :comments no
(package! org-super-agenda)
#+end_src

****** Org Habit
#+begin_src emacs-lisp
  (require 'org-habit)
  (add-to-list 'org-modules 'org-habit)
  (setq org-habit-graph-column 60)
#+end_src
****** Bibtex
#+begin_src emacs-lisp
;; (require 'oc-basic)
;; (require 'oc-csl)
;; (require 'oc-natbib)
(setq
 bibtex-completion-notes-path org_notes
 bibtex-completion-bibliography zot_bib
 bibtex-completion-pdf-field "file"
 bibtex-completion-notes-template-multiple-files
 (concat
  "#+title: ${title}\n"
  "* Org Noter\n"
  ":PROPERTIES:\n"
  ":Custom_ID: ${=key=}\n"
  ":NOTER_DOCUMENT: %(orb-process-file-field \"${=key=}\")\n"
  ":AUTHOR: ${author-abbrev}\n"
  ":JOURNAL: ${journaltitle}\n"
  ":DATE: ${date}\n"
  ":YEAR: ${year}\n"
  ":DOI: ${doi}\n"
  ":URL: ${url}\n"
  ":END:\n\n"
  )
 )
#+end_src
****** Org Latex
Make sure you use bibtex as part of the export process
#+begin_src emacs-lisp
(setq org-latex-pdf-process
      '("latexmk -shell-escape -bibtex -pdf %f"))
#+end_src
****** Load Font Setup
#+begin_src emacs-lisp
  (a3madkour/org-font-setup)
)
#+end_src
***** Behaviour
****** Citeproc
#+begin_src emacs-lisp :tangle "packages.el" :comments no
(package! citeproc)
#+end_src
****** Org Books
#+begin_src emacs-lisp :tangle "packages.el" :comments no
(package! org-books
  :recipe (:host github :repo "lepisma/org-books"))
#+end_src

#+begin_src emacs-lisp
(after! org-books
  (setq org-books-file "~/org/reading-list.org")
)
#+end_src
****** Org Ref
#+begin_src emacs-lisp :tangle "packages.el" :comments no
;; (package! org-ref)
#+end_src
#+begin_src emacs-lisp
;; (use-package! org-ref
;;   :config
;;   (setq
;;    org-ref-completion-library 'org-ref-ivy-cite
;;    org-ref-get-pdf-filename-function 'org-ref-get-pdf-filename-helm-bibtex
;;    org-ref-default-bibliography (list zot_bib)
;;    org-ref-bibliography-notes (concat org_notes "/bibnotes.org")
;;    org-ref-note-title-format "%y - %t\n :PROPERTIES:\n  :Custom_ID: %k\n  :NOTER_DOCUMENT: %F\n :AUTHOR: %9a\n  :JOURNAL: %j\n  :YEAR: %y\n  :VOLUME: %v\n  :PAGES: %p\n  :DOI: %D\n  :URL: %U\n :END:\n\n"
;;    org-ref-notes-directory org_notes
;;    org-ref-notes-function 'orb-edit-notes
;;    ))
#+end_src
****** Org Roam Bibtex
#+begin_src emacs-lisp :tangle "packages.el" :comments no
(package! org-roam-bibtex)
#+end_src

#+begin_src emacs-lisp
(use-package! org-roam-bibtex
  :after (org-roam)
  :hook (org-roam-mode . org-roam-bibtex-mode)
  :config
  (setq orb-preformat-keywords
        '("=key=" "title" "url" "file" "author-or-editor" "keywords"))
  (setq org-roam-capture-templates
             '(("r" "ref" plain 
           "%?"
           :target
           (file+head "${slug}.org" "#+TITLE: ${=key=}: ${title}\n#+ROAM_KEY: ${ref}

- tags ::
- keywords :: ${keywords}

\n* ${title}\n  :PROPERTIES:\n  :Custom_ID: ${=key=}\n  :URL: ${url}\n  :AUTHOR: ${author-or-editor}\n  :NOTER_DOCUMENT: %(orb-process-file-field \"${=key=}\")\n  :NOTER_PAGE: \n  :END:\n\n")

           :unnarrowed t))))
#+end_src
****** Org Noter
Doom installs org-noter via the init.el file. This is just for configuration.
#+begin_src emacs-lisp
(use-package! org-noter
  :after (:any org pdf-view)
  :config
  (setq
   ;; Split the window horizontally
   ;; org-noter-notes-window-location 'horizontal-split
   ;; Please stop opening frames
   org-noter-always-create-frame nil
   ;; Everything is relative to the main notes file
   org-noter-notes-search-path (list org_notes)
   )
  )
#+end_src

Make the evil state normal when looking at a pdf in org-noter
#+begin_src emacs-lisp
(add-hook! org-noter-doc-mode
  (evil-normal-state)
  )
#+end_src

****** Citar
#+begin_src emacs-lisp :tangle "packages.el" :comments no
(package! citar)
#+end_src
#+begin_src emacs-lisp
(use-package! citar
  :config
(setq
 citar-bibliography  '("~/org/notes/library.bib")
 citar-open-note-function 'orb-citar-edit-note
 org-cite-insert-processor 'citar
 org-cite-follow-processor 'citar
 org-cite-activate-processor 'citar
 citar-at-point-function 'embark-act
  )
)
#+end_src
****** Org PDFTools
Doom installs org-pdftools via the init.el file. This is just for configuration.
#+begin_src emacs-lisp
(use-package! org-pdftools
  :hook (org-load . org-pdftools-setup-link))
#+end_src
****** Org Noter PDFTools
#+begin_src emacs-lisp :tangle "packages.el" :comments no
(package! org-noter-pdftools)
#+end_src
****** Org Latex Impatient
#+begin_src emacs-lisp :tangle "packages.el" :comments no
(package! org-latex-impatient)
#+end_src
* Keybindings
** Insert
#+begin_src emacs-lisp
(map! :leader
      (:prefix "i"
      "b" #'org-books-add-url
      "c" #'org-cite-insert
      )
)
;;adding a keymap for insert note in org-noter
;; (map!
;;  :ne "SPC i n" #'org-noter-insert-note
;; )
(map!
 :mode org-noter-doc-mode
 :ne "i" #'org-noter-insert-note
 )
#+end_src
** Projectile
#+begin_src emacs-lisp
(map! :leader
      (:prefix "p"
       "l" #'projectile-replace
       )
)
#+end_src
** Toggles
#+begin_src emacs-lisp
(map! :leader
      (:prefix "t"
       "C" #'centered-window-mode)
)
#+end_src
** Agenda
#+begin_src emacs-lisp
;; (map! :leader
;;       (:prefix "d"
;;       :desc "Habits" "h" (lambda () (interactive) (find-file "~/org/habits.org"))
;;       :desc "Tasks" "t" (lambda () (interactive) (find-file "~/org/tasks.org"))
;;       "c" #'cfw:open-org-calendar
;;       )
;; )
#+end_src
** Langtool
#+begin_src emacs-lisp
(map! :leader
      (:prefix "l"
      "b" #'langtool-check
      "c" #'langtool-corrct-buffer
      "m" #'langtool-show-message-at-point
      "d" #'langtool-check-done
      "n" #'langtool-goto-next-eror
      "p" #'langtool-goto-previous-error
      )
)
#+end_src
** Bibtex actions
#+begin_src emacs-lisp
(map! :leader
      (:prefix "z"
      "n" #'citar-open-notes
      "o" #'citar-open
      "c" #'citar-insert-citation
      "i" #'org-cite-insert
      "b" #'citar-insert-bibtex
      )
)
#+end_src
** Search
#+begin_src emacs-lisp
(map! :map doom-leader-search-map
      (
       "m" #'consult-multi-occur
       )
)
#+end_src
** Hippie Expand
#+begin_src emacs-lisp
(global-set-key [remap dabbrev-expand] 'hippie-expand)
#+end_src
* Registers/Bookmarks
#+begin_src emacs-lisp
(set-register ?h '(file . "~/org/habits.org"))
(set-register ?t '(file . "~/org/tasks.org"))
(set-register ?i '(file . "~/org/ideas.org"))
(setq bookmark-default-file "~/.doom.d/bookmarks")
(bookmark-load bookmark-default-file t)
#+end_src
* Fix(es)?
** Org-mode error
#+begin_src emacs-lisp
(add-hook 'org-mode-hook (lambda () (electric-indent-local-mode -1)))
#+end_src
