.doom.d/packages.el

(package! org-super-agenda)

(package! org-books
  :recipe (:host github :repo "lepisma/org-books"))

(package! org-ref)

(package! org-roam-bibtex)

(package! org-noter-pdftools)

(package! org-latex-impatient)
